Лекция 1 Базовый SQL 
======================

In [1]:
%load_ext sql
%sql sqlite://

'Connected: @None'

Пара замечаний:
 * Мы используем веб-интерфейс для python, поэтому для запуска SQL запросов необходимо применить ряд вещей:
     * Необходимо подключить расширение SQL через так называемые magic command. [Более подробно здесь](https://ipython.readthedocs.io/en/stable/interactive/magics.html)
     * Для работы с SQL надо вызвать либо %sql для однострочной команды, либо %%sql - для многострочной
     * При использовании выражения SELECT результатом вывода является таблица, но при этом в notebook выводится уже внутренне представление языка python (объект класса sql.run.resultset, подробности далее), что приводит к ряду несоответствий (например, None вместо NULL)

Давайте создадим таблицу, заполним ее и сделаем какой-нибудь запрос!

In [2]:
%%sql drop table if exists product;
create table product(
       pname        varchar primary key, -- имя продукта
       price        money,               -- цена продукта
       category     varchar,             -- категория
       manufacturer varchar NOT NULL     -- производитель
);
insert into product values('Пряник', 19.99, 'Еда', 'Тульский пряник');
insert into product values('Тетрадь', 29.99, 'Канцелярия', 'Эксмо');
insert into product values('Печенье', 149.99, 'Еда', 'WagonWiels');
insert into product values('Планшет', 203.99, 'Техника', 'Zua');

 * sqlite://
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Посмотрим на полученную таблицу.

In [5]:
%sql select * from product;

 * sqlite://
Done.

[('Пряник', 19.99, 'Еда', 'Тульский пряник'),
 ('Тетрадь', 29.99, 'Канцелярия', 'Эксмо'),
 ('Печенье', 149.99, 'Еда', 'WagonWiels'),
 ('Планшет', 203.99, 'Техника', 'Zua')]

In [6]:
product_result=%sql select * from product

 * sqlite://
Done.

In [7]:
print(type(product_result))
print(product_result)

<class 'sql.run.ResultSet'>
+---------+--------+------------+-----------------+
|  pname  | price  |  category  |   manufacturer  |
+---------+--------+------------+-----------------+
|  Пряник | 19.99  |    Еда     | Тульский пряник |
| Тетрадь | 29.99  | Канцелярия |      Эксмо      |
| Печенье | 149.99 |    Еда     |    WagonWiels   |
| Планшет | 203.99 |  Техника   |       Zua       |
+---------+--------+------------+-----------------+

Обратите внимание на тип. Более подробно по данной библиотеки можно почитать:
https://github.com/catherinedevlin/ipython-sql

Немного SQL терминологии
--------------------------
* _имя_ таблицы - product.
* Каждая строка таблицы называется _строкой_ или _кортеж_. 
* Заметьте, что все кортежи имеют _поля_ или _атрибуты_.
* Количество строк называет _мощностью_, в то время как количество атрибутов _арностью_

Соглашения схемы
-----------------
* Схема таблицы продукта может быть описана следующим образом:

> product(<u>pname</u>, price, category, manufacturer)

Подчеркнутое множество атрибутов формирует  _ключ_.

* В этом случае ключ - pname. Если имя продукта было бы только уникальным для указнного производителя мы бы написали:

> product(<u>pname</u>, price, category, <u>manufacturer</u>)

Описание таблиц. Допущения для данной лекции
----------------
* Кортеж = запись (На текушем уровне понимания, на самом деле это не так)
  * Ограничение: все атрибуты - атомарного типа (это тоже не совсем корректное утверждение, так как существует довольно сложные типы)
  * Существует множество атомарных типов для SQL, например, по postgresQL можно посмотреть [здесь](http://www.postgresql.org/docs/9.4/static/datatype.html)
  .


* Таблица = мультимножество кортежей 
  * Мультимножество похоже на список
  * ... Но по определению оно не упорядочено: 
    * нет first(), нет next(), нет last().

# Итог
* Создана база данных  -- сделано!

* Простые запросы -- сейчас!

* Запрос с более чем одной таблицей -- далее!

# Простые запросы
* Рассмотрим основы SQL на примере
* В интернете очень много SQL туториалов, сейчас мы всего лишь вспомним базовые вещи

> SELECT <Множество атрибутов><br>
> FROM <список таблиц и условие на соединение><br>
> WHERE <список условий>

Это простейший SELECT-FROM-WHERE (SFW) блок. Давайте посмотрим на примерах!

In [8]:
%%sql
SELECT * 
  FROM Product 
 WHERE category = 'Канцелярия' 
   AND manufacturer = 'Эксмо'

 * sqlite://
Done.

[('Тетрадь', 29.99, 'Канцелярия', 'Эксмо')]

\* \- В данном случае обозначает вывод всех полей, которые были описаны во FROM

Посмотрим на примеры *проекции*, то есть получим только несколько атрибутов запроса.

In [9]:
%%sql 
SELECT Pname, 
       Price, 
       Manufacturer
  FROM Product;

 * sqlite://
Done.

[('Пряник', 19.99, 'Тульский пряник'),
 ('Тетрадь', 29.99, 'Эксмо'),
 ('Печенье', 149.99, 'WagonWiels'),
 ('Планшет', 203.99, 'Zua')]

* На выходе *все еще* таблица и ее схема -
> Answer(pname, price, manufacturer)

* Можно объединять выборку и проекцию

In [10]:
%%sql
SELECT Pname, Price, Manufacturer
FROM Product
WHERE category='Еда';

 * sqlite://
Done.

[('Пряник', 19.99, 'Тульский пряник'), ('Печенье', 149.99, 'WagonWiels')]

На выходе запроса к таблице - снова таблица 
---------------------------------

In [11]:
%%sql
SELECT
    p.manufacturer, p.pname, p.price
FROM 
    (SELECT distinct p0.category
     FROM Product p0
     WHERE p0.price < 20.00) cp, -- this is a nested query!
    Product p
WHERE 
    p.category = cp.category and p.price > 20.00

 * sqlite://
Done.

[('WagonWiels', 'Печенье', 149.99)]

Небольшие детали
--------------

* Некоторые элементы регистро-независимые:
  * Одно и то же: SELECT  Select  select
  * Одно и то же: Product   product
  * Разные: ‘Seattle’  ‘seattle’ (Здесь это строковая константа)
    * Строго говоря, в большинстве случаев это зависит от настроек СУБД
  

* Константы (одинарные кавычки)
  * ‘abc’  - да
  * “abc” - нет

In [12]:
%sql select * from product;

 * sqlite://
Done.

[('Пряник', 19.99, 'Еда', 'Тульский пряник'),
 ('Тетрадь', 29.99, 'Канцелярия', 'Эксмо'),
 ('Печенье', 149.99, 'Еда', 'WagonWiels'),
 ('Планшет', 203.99, 'Техника', 'Zua')]

LIKE
====

Опертоор LIKE нужен для поиска строк:
    
> SELECT *
> FROM Products
> WHERE pname like '%gizmo%'

Like - "сильно урезанный" regexp
* % - сколько угодно символов
* \_ ровно один символ
* оператор LIKE - регистрозависимый

In [13]:
%%sql
SELECT *  FROM product
where category LIKE '%да%'

 * sqlite://
Done.

[('Пряник', 19.99, 'Еда', 'Тульский пряник'),
 ('Печенье', 149.99, 'Еда', 'WagonWiels')]

Убрать дубли
---------------------
* Дубли не всегда хорошо, и иногда их стоит убирать
  * Помните, что таблицы - _мультимножества_!

In [14]:
%sql SELECT category from product;

 * sqlite://
Done.

[('Еда',), ('Канцелярия',), ('Еда',), ('Техника',)]

In [15]:
%%sql 
-- чтобы убрать дубли используйте слово DISTINCT
SELECT DISTINCT category from product;

 * sqlite://
Done.

[('Еда',), ('Канцелярия',), ('Техника',)]

Сортировка результатов
---------------------
* Так как Таблица - это мультимножество, то порядок вывода строк не гарантирован. Иногда необходимо выводить строки в определенном порядке

In [16]:
%%sql
-- сортировка результатов
-- сортировка по умолчанию - ascending
SELECT   pname, price, manufacturer
FROM     Product
WHERE    price > 50
ORDER BY  price, pname

 * sqlite://
Done.

[('Печенье', 149.99, 'WagonWiels'), ('Планшет', 203.99, 'Zua')]

In [17]:
%%sql
-- сортировка результатов
-- тип сортировки каждого компонента определяется индивидуально
SELECT   price, manufacturer
FROM     Product
ORDER BY   manufacturer ASC, price DESC

 * sqlite://
Done.

[(149.99, 'WagonWiels'),
 (203.99, 'Zua'),
 (19.99, 'Тульский пряник'),
 (29.99, 'Эксмо')]

Можно делать сортировку по порядковому номеру, но довольно часто это считается bad practice

In [18]:
%%sql
SELECT   price, manufacturer
FROM     Product
ORDER BY   1 ASC, 2 DESC

 * sqlite://
Done.

[(19.99, 'Тульский пряник'),
 (29.99, 'Эксмо'),
 (149.99, 'WagonWiels'),
 (203.99, 'Zua')]

Работа с несколькими таблицами
------


* Рассмотрим таблицу компаний.
> company(<u>cname</u>, stockprice, country)

In [19]:
%%sql
drop table if exists product; -- This needs to be dropped if exists, see why further down!
drop table if exists company;
create table company (
    cname varchar primary key, -- company name uniquely identifies the company.
    stockprice money, -- stock price is in money 
    country varchar); -- country is just a string
insert into company values ('Тульский пряник', 25.0, 'Россия');
insert into company values ('Эксмо', 65.0, 'Россия');
insert into company values ('Zua', 15.0, 'Китай');

 * sqlite://
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [20]:
%sql select * from company;

 * sqlite://
Done.

[('Тульский пряник', 25, 'Россия'),
 ('Эксмо', 65, 'Россия'),
 ('Zua', 15, 'Китай')]

Внешние ключи
-----------------------
* Допустим мы ходим добавить таблицу продуктов

> Product(pname, price, category, manufacturer)

* Может возникнуть следующая ситуация: есть компания, продающая какие-то продукты, но при этом она отсутствует в таблице компаний.
* Чтобы избежать это, воспользуемя _внешними ключами_

Назвнание компании в product _ссылается_ на поле cnma из таблицы company:

> foreign key (manufacturer) references company(cname)

  * Замечание: cname <u>должно быть</u> ключом в  company!

In [21]:
%%sql drop table if exists product;
pragma foreign_keys = ON; -- WARNING by default off in sqlite
create table product(
       pname varchar primary key, -- name of the product
       price money, -- price of the product
       category varchar, -- category
       manufacturer varchar, -- manufacturer
       foreign key (manufacturer) references company(cname));

insert into product values('Пряник', 19.99, 'Еда', 'Тульский пряник');
insert into product values('Тетрадь', 29.99, 'Канцелярия', 'Эксмо');
insert into product values('Печенье', 149.99, 'Еда', 'Тульский пряник');
insert into product values('Планшет', 203.99, 'Техника', 'Zua');

 * sqlite://
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Внешние ключи являются _ограничениями_ таблицы 
> Что случится при вставке компании, которой не в таблице company?

In [22]:
try:
    %sql insert into product values('MultiTouch', 203.99, 'Household', 'Google');
except Exception as e:
    print (e)
    print ("Rejected!")

 * sqlite://
(sqlite3.IntegrityError) FOREIGN KEY constraint failed
[SQL: insert into product values('MultiTouch', 203.99, 'Household', 'Google');]
(Background on this error at: http://sqlalche.me/e/gkpj)
Rejected!

In [23]:
%%sql
-- the update is rejected!
select * from product;

 * sqlite://
Done.

[('Пряник', 19.99, 'Еда', 'Тульский пряник'),
 ('Тетрадь', 29.99, 'Канцелярия', 'Эксмо'),
 ('Печенье', 149.99, 'Еда', 'Тульский пряник'),
 ('Планшет', 203.99, 'Техника', 'Zua')]

Внешние ключи и удаление
=============

* Что произойдет, если мы удалим компанию ? Несколько вариантов:
  * Запретить удаление (default)
  * Удалить все продукты (добавьте "`on delete cascade`")
  * Замена на  NULL или DEFAULT

**Первый вариант (default)- Удаление запрещено**

In [24]:
try:
    %sql delete from company where cname = 'Zua';
except Exception as e:
    print (e)
    print ("Disallowed!")

 * sqlite://
(sqlite3.IntegrityError) FOREIGN KEY constraint failed
[SQL: delete from company where cname = 'Zua';]
(Background on this error at: http://sqlalche.me/e/gkpj)
Disallowed!

**Второй вариант: удалить все продукты, принадлежащие компании, которую мы удаляем**

Необходимо изменить опеределение в create table:
> foreign key (manufacturer) references company(cname) on delete cascade

Теперь, когда строка компании удалена, все продукты с указанной компанией, будут также удалены.

Соединения
------
> Product (<u>pname</u>,  price, category, manufacturer)<br>
> Company (<u>cname</u>, stockPrice, country)

Мы хотим ответить на вопрос

> Найти все продукты меньшие 200$, произведенные в России
> Возвратить их имена и цену.

In [25]:
%%sql
SELECT pname, price
FROM product, company
where manufacturer=cname and country='Россия' and price <= 200;

 * sqlite://
Done.

[('Пряник', 19.99), ('Тетрадь', 29.99), ('Печенье', 149.99)]

Другой вариант написания запроса.

In [26]:
%%sql -- Часть 1: выбрать все компании из России
SELECT distinct cname -- нужна ли нам уникальность?
from company where country='Россия';

 * sqlite://
Done.

[('Тульский пряник',), ('Эксмо',)]

In [27]:
%%sql -- Part 2: Продукты до 200
select distinct pname, price, manufacturer
from product
where price <= 200;

 * sqlite://
Done.

[('Печенье', 149.99, 'Тульский пряник'),
 ('Пряник', 19.99, 'Тульский пряник'),
 ('Тетрадь', 29.99, 'Эксмо')]

In [28]:
%%sql -- Объединение как cross join
SELECT * 
FROM 
  (SELECT DISTINCT pname, price, manufacturer
   FROM product
   WHERE price <= 200) CheapProducts,
  (SELECT DISTINCT cname
   FROM company
   WHERE country='Россия') JapaneseProducts;

 * sqlite://
Done.

[('Печенье', 149.99, 'Тульский пряник', 'Тульский пряник'),
 ('Печенье', 149.99, 'Тульский пряник', 'Эксмо'),
 ('Пряник', 19.99, 'Тульский пряник', 'Тульский пряник'),
 ('Пряник', 19.99, 'Тульский пряник', 'Эксмо'),
 ('Тетрадь', 29.99, 'Эксмо', 'Тульский пряник'),
 ('Тетрадь', 29.99, 'Эксмо', 'Эксмо')]

In [29]:
%%sql
-- Фильтруем cross join
SELECT DISTINCT pname, price
FROM 
  (SELECT DISTINCT pname, price, manufacturer
   FROM product
   WHERE price <= 200) CheapProducts,
  (SELECT distinct cname
   FROM company
   WHERE country='Россия') JapaneseProducts
WHERE cname = manufacturer;

 * sqlite://
Done.

[('Печенье', 149.99), ('Пряник', 19.99), ('Тетрадь', 29.99)]

# Использование конструкции JOIN

Есть другой вариант записи - через конструкцию JOIN. Кроме этого она позволяет делать также внешние запросы.

In [30]:
%%sql
SELECT pname, 
       price
  FROM product p 
  JOIN company c 
    ON p.manufacturer = c.cname
 WHERE c.country='Россия' 
   AND p.price <= 200;

 * sqlite://
Done.

[('Пряник', 19.99), ('Тетрадь', 29.99), ('Печенье', 149.99)]

Примечания
--------
* Есть множество логических вариантов написать один и тот же запрос
    * Этот факт будет использоваться для оптимизации

Дубли после соединения
--------------------------

Замечание - могут возникнуть дубли после соединения...

In [31]:
%%sql -- duplicate answer
SELECT Country
FROM Product, Company
WHERE  Manufacturer=CName AND Category='Еда';

 * sqlite://
Done.

[('Россия',), ('Россия',)]

# Группировка

Можно осуществлять схлопывание таблиц в рамках каких-нибудь групп
После схлопывания можно применять так называемые агрегатные функции
AVG(<поле>) 
SUM(<поле>)
MIN(<поле>)
MAX(<поле>)
COUNT(<поле>)
COUNT(*)
AVG(distinct <поле>)
SUM(distinct <поле>)
COUNT(distinct <поле>)

In [36]:
%%sql 
select category, avg(price), min(price), max(price)
from Product
group by category

 * sqlite://
Done.

[('Еда', 84.99000000000001, 19.99, 149.99),
 ('Канцелярия', 29.99, 29.99, 29.99),
 ('Техника', 203.99, 203.99, 203.99)]

Существует возможность фильтровать не только по строкам, но и по группам. Для этого можно использовать инструкцию HAVING

In [38]:
%%sql 
select category, avg(price), min(price), max(price)
from Product
group by category
having min(price) > 20

 * sqlite://
Done.

[('Канцелярия', 29.99, 29.99, 29.99), ('Техника', 203.99, 203.99, 203.99)]